// pch.h: Ёто предварительно скомпилированный заголовочный файл.
// ѕеречисленные ниже файлы компилируютс€ только один раз, что ускор€ет последующие сборки.
// Ёто также вли€ет на работу IntelliSense, включа€ завершение кода и многие функции просмотра кода.
// ќднако изменение любого из приведенных здесь файлов между операци€ми сборки приведет к повторной компил€ции всех(!) этих файлов.
// Ќе добавл€йте сюда файлы, которые планируетс€ часто измен€ть, так как в этом случае выигрыша в производительности не будет.

#ifndef PCH_H
#define PCH_H

// ƒобавл€йте заголовочные файлы дл€ предварительной компил€ции
#include "TextEditorCore.h"
#include <string>
#include <vector>
#include <stack>
#include <memory>
#include <fstream>
#include <codecvt>
#include <locale>

#endif //PCH_H